System Bootstrap, Version 12.1(3r)T2, RELEASE SOFTWARE (fc1)
Copyright (c) 2000 by cisco Systems, Inc.
PT 1001 (PTSC2005) processor (revision 0x200) with 60416K/5120K bytes of memory

Readonly ROMMON initialized

Self decompressing the image :
######################### [OK]

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco Internetwork Operating System Software
IOS (tm) PT1000 Software (PT1000-I-M), Version 12.2(28), RELEASE SOFTWARE (fc5)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2005 by cisco Systems, Inc.
Compiled Wed 27-Apr-04 19:01 by miwang

PT 1001 (PTSC2005) processor (revision 0x200) with 60416K/5120K bytes of memory
.
Processor board ID PT0123 (0123)
PT2005 processor: part number 0, mask 01
Bridging software.
X.25 software, Version 3.0.0.
4 FastEthernet/IEEE 802.3 interface(s)
2 Low-speed serial(sync/async) network interface(s)
32K bytes of non-volatile configuration memory.
63488K bytes of ATA CompactFlash (Read/Write)

Press RETURN to get started!


%LINK-5-CHANGED: Interface Serial2/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

00:00:10: %OSPF-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial2/0 from LOADING to FULL, Loading Done


ASBR>en
ASBR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ASBR(config)#int se
ASBR(config)#int serial 2/0
ASBR(config-if)#ip add
ASBR(config-if)#ip address 192.168.2.2 255.255.255.0
ASBR(config-if)#exit
ASBR(config)#int sta
ASBR(config)#int static null0
                  ^
% Invalid input detected at '^' marker.
	
ASBR(config)#int null0
                 ^
% Invalid input detected at '^' marker.
	
ASBR(config)#








ASBR con0 is now available






Press RETURN to get started.













ASBR>en
ASBR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ASBR(config)#ip rout
ASBR(config)#ip route 1.0.0.0 255.0.0.0 null0
ASBR(config)#ip route 2.0.0.0 255.0.0.0 null0
ASBR(config)#ip route 3.0.0.0 255.0.0.0 null0
ASBR(config)#route os
ASBR(config)#route ospf 1
ASBR(config-router)#ne
ASBR(config-router)#net
ASBR(config-router)#network 192.168.2.0 0.0.0.255 area 1
ASBR(config-router)#network 1.0.0.0 0.255.255.255 area 1
ASBR(config-router)#network 2.0.0.0 0.255.255.255 area 1
ASBR(config-router)#network 3.0.0.0 0.255.255.255 area 1
ASBR(config-router)#end
ASBR#
%SYS-5-CONFIG_I: Configured from console by console
wr mem
Building configuration...
[OK]
ASBR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ASBR(config)#rou
ASBR(config)#router os
ASBR(config)#router ospf 1
ASBR(config-router)#net
ASBR(config-router)#network 








ASBR con0 is now available






Press RETURN to get started.











ASBR>en
ASBR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ASBR(config)#rout
ASBR(config)#router os
ASBR(config)#router ospf 1
ASBR(config-router)#area 1 s
ASBR(config-router)#area 1 stub 
ASBR(config-router)#
04:11:24: %OSPF-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial2/0 from FULL to DOWN, Neighbor Down: Adjacency forced to reset

04:11:24: %OSPF-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial2/0 from FULL to DOWN, Neighbor Down: Interface down or detached

04:13:20: %OSPF-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial2/0 from LOADING to FULL, Loading Done







